###pandas 
1. Pandas Datafram
2. Pandas series
3. Pandas basic operation

In [15]:
pip install pandas

Requirement already satisfied: pandas in c:\users\shubham\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\shubham\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\shubham\anaconda3\lib\site-packages (from pandas) (2022.7.1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\shubham\anaconda3\lib\site-packages (from pandas) (1.24.2)
Requirement already satisfied: six>=1.5 in c:\users\shubham\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [16]:
import pandas as pd
import numpy as np

In [17]:
np.arange(0,20).reshape(5,4)

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15],
       [16, 17, 18, 19]])

In [18]:
## create dataframe 
df=pd.DataFrame(data=np.arange(0,20).reshape(5,4),index=["r1","r2","r3","r4","r5"],columns=["col1","col2","col3","col4"])

In [19]:
df

    col1  col2  col3  col4
r1     0     1     2     3
r2     4     5     6     7
r3     8     9    10    11
r4    12    13    14    15
r5    16    17    18    19

In [20]:
type(df)

pandas.core.frame.DataFrame

In [21]:
df.head(2)

    col1  col2  col3  col4
r1     0     1     2     3
r2     4     5     6     7

In [22]:
df.tail(1)

    col1  col2  col3  col4
r5    16    17    18    19

In [23]:
df.describe()

            col1       col2       col3       col4
count   5.000000   5.000000   5.000000   5.000000
mean    8.000000   9.000000  10.000000  11.000000
std     6.324555   6.324555   6.324555   6.324555
min     0.000000   1.000000   2.000000   3.000000
25%     4.000000   5.000000   6.000000   7.000000
50%     8.000000   9.000000  10.000000  11.000000
75%    12.000000  13.000000  14.000000  15.000000
max    16.000000  17.000000  18.000000  19.000000

In [24]:
df[['col1','col2','col3']]

    col1  col2  col3
r1     0     1     2
r2     4     5     6
r3     8     9    10
r4    12    13    14
r5    16    17    18

In [25]:
df['col1'] #not showing col name. it is a series

r1     0
r2     4
r3     8
r4    12
r5    16
Name: col1, dtype: int32

1 col without col name is called as series

In [26]:
df

    col1  col2  col3  col4
r1     0     1     2     3
r2     4     5     6     7
r3     8     9    10    11
r4    12    13    14    15
r5    16    17    18    19

## retriving data with respect to row index

In [27]:
df.loc[['r1','r3']]

    col1  col2  col3  col4
r1     0     1     2     3
r3     8     9    10    11

In [28]:
df.iloc[0:3,0:2]

    col1  col2
r1     0     1
r2     4     5
r3     8     9